'use client'

import Image from 'next/image'
import { useState } from 'react'

import delivery from '@/assets/images/delivery.jpg'
import {
    Collapsible,
    CollapsibleContent,
    CollapsibleTrigger
} from '@/components/ui/collapsible'
import { ScrollArea } from '@/components/ui/scroll-area'

export const Delivery = () => {
    const [isDeliveryOpen, setIsDeliveryOpen] = useState(false)

    return (
        <section className='mt-28 flex items-start justify-between gap-x-10 px-20 max-lg:flex-col max-md:mt-16 max-md:px-16 max-sm:mt-10 max-sm:px-4'>
            <Image
                src={delivery}
                alt='Доставка'
                className='shrink-0 rounded-[22px] object-cover max-lg:h-80 max-lg:w-full max-md:h-60 max-sm:hidden'
            />

            <div className='max-lg:mt-10'>
                <h2 className='text-[28px] font-bold'>
                    Оперативна доставка квітів по Києву
                </h2>
                {isDeliveryOpen ? null : (
                    <p className='mt-10 max-lg:mt-6'>
                        Немає часу особисто підібрати квітковий подарунок для рідних чи
                        колег? Не турбуйтесь! З послугами доставки квітів у Києві купити
                        свіжозрізані квіти онлайн стало ще простіше. Виберіть із нашого
                        широкого асортименту гарні квіткові композиції або скористайтесь
                        цікавою новою послугою «замовлення букета по фото». А з
                        експрес-доставкою ваш букет буде у вас вже за 2 години після
                        замовлення.
                    </p>
                )}
                <Collapsible
                    open={isDeliveryOpen}
                    onOpenChange={setIsDeliveryOpen}>
                    <CollapsibleContent>
                        <ScrollArea className='mt-10 h-72 pr-2 max-lg:mt-6'>
                            <p>
                                Немає часу особисто підібрати квітковий подарунок для
                                рідних чи колег? Не турбуйтесь! З послугами доставки
                                квітів у Києві купити свіжозрізані квіти онлайн стало ще
                                простіше. Виберіть із нашого широкого асортименту гарні
                                квіткові композиції або скористайтесь цікавою новою
                                послугою «замовлення букета по фото». А з
                                експрес-доставкою ваш букет буде у вас вже за 2 години
                                після замовлення.
                            </p>
                            <p className='mt-4'>
                                Скориставшись послугою доставка квітів, ви зможете
                                скористатися досвідом та творчим підходом професійних
                                флористів, які ретельно оформляють кожен букет. Це
                                гарантує, що ваш подарунок прибуде у первозданному вигляді
                                та продемонструє красу вибраних квітів. Крім того,
                                зручність онлайн-замовлення дозволяє вивчити різні
                                варіанти, порівняти ціни та знайти ідеальний букет, не
                                виходячи з дому чи офісу.
                            </p>
                            <p className='mt-4'>
                                Що робить квіти найкращим подарунком? Квіти вже давно
                                займають особливе місце серед подарунків, і на те є вагомі
                                причини. Їхня вроджена краса і чарівний аромат роблять їх
                                вічним вибором, який завжди приносить радість як
                                дарувальнику, так і одержувачу. Чи виберете ви розкішні
                                троянди або скромні маргаритки, ці ніжні рослини здатні
                                викликати неймовірні емоції у тих, хто їх отримує. Ось
                                кілька причин, з яких квіти вважаються найкращим
                                подарунком:
                                <ul className='mt-1 list-disc pl-10'>
                                    <li>
                                        Квіти мають здатність передавати широкий спектр
                                        емоцій, від любові та захоплення до співчуття та
                                        подяки. Якщо ви хочете висловити прихильність,
                                        вибачитися, привітати або просто прикрасити чийсь
                                        день, квіти можуть передати ваші почуття таким
                                        чином, що часто не вистачає слів;
                                    </li>
                                    <li>
                                        Незалежно від віку, статі чи походження, вигляд
                                        красиво складеного букета може миттєво підняти
                                        настрій та викликати посмішку на чиємусь обличчі.
                                        Їхня універсальність і широка привабливість
                                        роблять їх ідеальним вибором для будь-якого
                                        випадку та одержувача;
                                    </li>
                                    <li>
                                        Квіткові магазини з доставкою позбавлять вас
                                        необхідності відвідувати фізичний магазин. Усього
                                        кількома клацаннями миші або телефонним дзвінком
                                        ви можете легко вибрати та замовити гарний букет з
                                        доставкою у потрібне місце;
                                    </li>
                                    <li>
                                        Кожен вид квітки несе в собі свою символіку і
                                        значення, що дозволяє ще більше персоналізувати
                                        свій подарунок. Вибираючи квіти, які мають
                                        значення для одержувача чи випадку, ви додаєте
                                        глибину та продуманість своєму подарунку;
                                    </li>
                                    <li>
                                        Краса квітів незаперечна. Їхні яскраві кольори,
                                        ніжні пелюстки та витончені форми полонять почуття
                                        та створюють візуальне свято. Незалежно від того,
                                        представлені вони у вигляді одного стебла або
                                        складного букета, квіти мають чудову здатність
                                        прикрашати будь-який простір і створювати теплу та
                                        затишну атмосферу;
                                    </li>
                                    <li>
                                        Науково доведено, що квіти можуть позитивно
                                        впливати на психічне та емоційне благополуччя.
                                        Дослідження показали, що оточення квітами може
                                        зменшити стрес, підняти настрій та викликати
                                        відчуття щастя та спокою;
                                    </li>
                                    <li>
                                        Жест дарування квітів справляє незабутнє враження
                                        і зміцнює зв'язок між людьми.
                                    </li>
                                </ul>
                            </p>
                        </ScrollArea>
                    </CollapsibleContent>
                    <CollapsibleTrigger className='mt-4 flex w-full items-center justify-center text-center text-xl font-bold'>
                        Розгорнути
                    </CollapsibleTrigger>
                </Collapsible>
            </div>
        </section>
    )
}
