import { Courier } from './components/courier'
import { Post } from './components/post'
import { SelfDelivery } from './components/self-delivery'
import {
    Breadcrumb,
    BreadcrumbItem,
    BreadcrumbLink,
    BreadcrumbList,
    BreadcrumbPage,
    BreadcrumbSeparator
} from '@/components/ui/breadcrumb'

const PaymentAndDeliveryPage = () => {
    return (
        <>
            <section className='mt-12 px-20 max-md:px-16 max-sm:mt-8 max-sm:px-4'>
                <Breadcrumb className='px-20 max-md:px-16 max-sm:px-4'>
                    <BreadcrumbList className='max-sm:justify-center'>
                        <BreadcrumbItem>
                            <BreadcrumbLink href='/'>Головна</BreadcrumbLink>
                        </BreadcrumbItem>
                        <BreadcrumbSeparator />
                        <BreadcrumbItem>
                            <BreadcrumbPage>Оплата і доставка</BreadcrumbPage>
                        </BreadcrumbItem>
                    </BreadcrumbList>
                </Breadcrumb>
                <h1 className='mt-4 text-center text-[28px] font-semibold'>
                    Оплата і доставка
                </h1>
            </section>

            <SelfDelivery />

            <Courier />
            <section className='mt-16 space-y-4 px-20 max-md:px-16 max-sm:mt-8 max-sm:px-4'>
                <h2 className='sr-only text-[28px] font-semibold'>Деталі замовлення</h2>
                <p>
                    Шановні клієнти, під час здійснення замовлення з кур'єрською доставкою
                    необхідно врахувати, що мінімальний час на виконання замовлення
                    складає 2 години. Доставка замовлень здійснюється щоденно. У дні
                    підвищеного завантаження (Новий рік, День Закоханих, 8 березня, День
                    матері, інші державні свята) умови доставки можуть змінюватися.
                </p>
                <p>
                    Враховуючи наявність в асортименті Товарів, доставка яких здійснюється
                    протягом 3-7 календарних днів, з метою встановлення точної дати
                    доставки Товару, просимо уточнювати відповідну інформацію у оператора
                    контакт-центру.
                </p>
                <p>
                    Доставка виконується за адресою, вказаною в замовленні. У разі якщо
                    одержувача немає на місці, букет буде залишений родичам, знайомим,
                    консьєржу, колегам або іншим третім особам. В такому разі кошти за
                    невручення букета одержувачу Замовнику не повертаються. Замовник несе
                    повну відповідальність за інформацію, надану Виконавцю в замовлені.
                </p>
                <p>
                    У випадку порушення терміну доставки з вини Виконавця споживачу
                    необхідно звернутись до нашого контакт-центру для погодження умов
                    можливого повернення коштів.
                </p>
                <p>
                    Замовляючи доставку товару кур'єром - при отриманні обов'язково
                    перевіряйте наявність всього товару згідно замовлення, а також його
                    зовнішній вигляд (кількість, цілісність упаковки, крихких предметів
                    на: сколи, тріщини, подряпини) У випадку пошкодження товару, або
                    неповної комплектації - необхідно обов'язково повідомити кур'єру і
                    зв'язатися з Виконавцем за допомогою одного з номерів із розділу
                    «Контакти».
                </p>

                <p>
                    З метою забезпечення безпеки життя та здоров'я працівників Виконавця
                    під час дії сигналу «повітряна тривога» час доставки, а також видача
                    замовлень можуть бути змінено компанією в односторонньому порядку.
                </p>
            </section>
            <Post />
        </>
    )
}

export default PaymentAndDeliveryPage
