export const Post = () => {
    return (
        <section className='mt-12 px-20 max-md:px-16 max-sm:mt-8 max-sm:px-4'>
            <h2 className='text-[28px] font-semibold'>Нова пошта</h2>

            <div className='mt-10 space-y-4'>
                <p>Доставка по місту Київ працює щодня цілодобово!</p>
                <p>
                    Доставка Новою поштою по всій Україні: У відділення «Нової пошти» або
                    кур'єром за вашою адресою
                </p>
                <p>
                    Умови доставки: <br /> Доставка сервісом Нова Пошта можлива лише при
                    передоплаті Вартість доставки сплачується згідно тарифів та умов
                    кур'єрської службы «Нова пошта». Сроки та графік доставки замовлення
                    залежать від адреси отримувача, а також умов сервісу «Нова пошта».
                </p>
                <p>Якщо є питання, Ви можете зв'язатися з нашим менеджером.</p>
            </div>
        </section>
    )
}
